day1/load_testing/logs/async_sleep_2/thin/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		       90    hits
Availability:		      100.00 %
Elapsed time:		       10.51 secs
Data transferred:	        0.00 MB
Response time:		     2973.22 ms
Transaction rate:	        8.56 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       25.46
Successful transactions:       90
Failed transactions:	        0
Longest transaction:	     3030.00 ms
Shortest transaction:	     2890.00 ms
 
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		      120    hits
Availability:		      100.00 %
Elapsed time:		       10.95 secs
Data transferred:	        0.01 MB
Response time:		     2811.92 ms
Transaction rate:	       10.96 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       30.82
Successful transactions:      120
Failed transactions:	        0
Longest transaction:	     3020.00 ms
Shortest transaction:	     2400.00 ms
 
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		      150    hits
Availability:		      100.00 %
Elapsed time:		       10.95 secs
Data transferred:	        0.01 MB
Response time:		     2835.00 ms
Transaction rate:	       13.70 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       38.84
Successful transactions:      150
Failed transactions:	        0
Longest transaction:	     3040.00 ms
Shortest transaction:	     2470.00 ms